HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_bf.h
/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_OFF (21)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_LEN (30)

/** \\brief  Mask for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBADD10_Bits.ADDRESS */
#define IFX_XBAR_DBADD10_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBADD10_Bits.ADDRESS */
#define IFX_XBAR_DBADD10_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBADD10_Bits.ADDRESS */
#define IFX_XBAR_DBADD10_ADDRESS_OFF (29)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.ADDEN */
#define IFX_XBAR_DBCON10_ADDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.ADDEN */
#define IFX_XBAR_DBCON10_ADDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.ADDEN */
#define IFX_XBAR_DBCON10_ADDEN_OFF (19)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.DBEN */
#define IFX_XBAR_DBCON10_DBEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.DBEN */
#define IFX_XBAR_DBCON10_DBEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.DBEN */
#define IFX_XBAR_DBCON10_DBEN_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.DBSAT */
#define IFX_XBAR_DBCON10_DBSAT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.DBSAT */
#define IFX_XBAR_DBCON10_DBSAT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.DBSAT */
#define IFX_XBAR_DBCON10_DBSAT_OFF (1)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.ERREN */
#define IFX_XBAR_DBCON10_ERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.ERREN */
#define IFX_XBAR_DBCON10_ERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.ERREN */
#define IFX_XBAR_DBCON10_ERREN_OFF (20)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.MASEN */
#define IFX_XBAR_DBCON10_MASEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.MASEN */
#define IFX_XBAR_DBCON10_MASEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.MASEN */
#define IFX_XBAR_DBCON10_MASEN_OFF (23)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.MASTER */
#define IFX_XBAR_DBCON10_MASTER_LEN (6)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.MASTER */
#define IFX_XBAR_DBCON10_MASTER_MSK (0x3f)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.MASTER */
#define IFX_XBAR_DBCON10_MASTER_OFF (24)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.RDEN */
#define IFX_XBAR_DBCON10_RDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON10_Bits.RDEN */
#define IFX_XBAR_DBCON10_RDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON10_Bits.RDEN */
#define IFX_XBAR_DBCON10_RDEN_OFF (16)

/** \\brief  Length for Ifx_XBAR_DBCON10_Bits.REARM */
#define IFX_XBAR_DBCON10_REARM_LEN (1)

