HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.ADDR_ECC */
#define IFX_XBAR_ERR10_ADDR_ECC_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.ADDR_ECC */
#define IFX_XBAR_ERR10_ADDR_ECC_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.ADDR_ECC */
#define IFX_XBAR_ERR10_ADDR_ECC_OFF (16)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.MCI_SBS */
#define IFX_XBAR_ERR10_MCI_SBS_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.MCI_SBS */
#define IFX_XBAR_ERR10_MCI_SBS_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.MCI_SBS */
#define IFX_XBAR_ERR10_MCI_SBS_OFF (24)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.OPC */
#define IFX_XBAR_ERR10_OPC_LEN (4)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.OPC */
#define IFX_XBAR_ERR10_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.OPC */
#define IFX_XBAR_ERR10_OPC_OFF (4)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.RD */
#define IFX_XBAR_ERR10_RD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.RD */
#define IFX_XBAR_ERR10_RD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.RD */
#define IFX_XBAR_ERR10_RD_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.SVM */
#define IFX_XBAR_ERR10_SVM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.SVM */
#define IFX_XBAR_ERR10_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.SVM */
#define IFX_XBAR_ERR10_SVM_OFF (2)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.TR_ID */
#define IFX_XBAR_ERR10_TR_ID_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.TR_ID */
#define IFX_XBAR_ERR10_TR_ID_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.TR_ID */
#define IFX_XBAR_ERR10_TR_ID_OFF (8)

/** \\brief  Length for Ifx_XBAR_ERR10_Bits.WR */
#define IFX_XBAR_ERR10_WR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR10_Bits.WR */
#define IFX_XBAR_ERR10_WR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR10_Bits.WR */
#define IFX_XBAR_ERR10_WR_OFF (1)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_OFF (16)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_OFF (24)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_LEN (4)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_OFF (4)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_OFF (2)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_OFF (8)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_OFF (1)

/** \\brief  Length for Ifx_XBAR_ERRADDR10_Bits.ADDR */
#define IFX_XBAR_ERRADDR10_ADDR_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ERRADDR10_Bits.ADDR */
#define IFX_XBAR_ERRADDR10_ADDR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ERRADDR10_Bits.ADDR */
#define IFX_XBAR_ERRADDR10_ADDR_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_OFF (6)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_LEN (7)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_MSK (0x7f)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_OFF (13)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_LEN (1)

