HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_bf.h
/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_OFF (9)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_OFF (10)

/** \\brief  Length for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_OFF (3)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_OFF (27)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_OFF (28)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_OFF (29)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_OFF (25)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI10 */
#define IFX_XBAR_IDINTEN_ENSCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI10 */
#define IFX_XBAR_IDINTEN_ENSCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI10 */
#define IFX_XBAR_IDINTEN_ENSCI10_OFF (10)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_MSK (0x1)

