HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_bf.h
/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI9 */
#define IFX_XBAR_IDINTEN_ENSCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI9 */
#define IFX_XBAR_IDINTEN_ENSCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI9 */
#define IFX_XBAR_IDINTEN_ENSCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_OFF (27)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_OFF (28)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_OFF (29)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_OFF (25)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI10 */
#define IFX_XBAR_IDINTSAT_IDSCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI10 */
#define IFX_XBAR_IDINTSAT_IDSCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI10 */
#define IFX_XBAR_IDINTSAT_IDSCI10_OFF (10)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_LEN (1)

